Ran Plan for project: `plateng-iac-597915711542-us-east-1` dir: `teams/plateng-iac/597915711542/us-east-1` workspace: `plateng-iac-597915711542-us-east-1`

<details><summary>Show Output</summary>

```diff
module.yhegde-test-btk.module.iac_s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.yhegde-test-btk.module.iac_s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.yhegde-test-btk.module.iac_s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=597915711542]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.yhegde-test-bkt.module.iac_s3_bucket.aws_s3_bucket.this[0] will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
- resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::yhegde-test-bkt" -> null
      - bucket                      = "yhegde-test-bkt" -> null
      - bucket_domain_name          = "yhegde-test-bkt.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "yhegde-test-bkt.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "yhegde-test-bkt" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "claimed_ownership"   = "true"
          - "managed-by"          = "iacasS"
          - "tcss:classification" = "green"
          - "tcss:tag-version"    = "1"
        } -> null
      - tags_all                    = {
          - "claimed_ownership"   = "true"
          - "managed-by"          = "iacasS"
          - "platform:team"       = "plateng-iac"
          - "region"              = "us-east-1"
          - "tcss:classification" = "green"
          - "tcss:owner"          = "plateng-iac"
          - "tcss:tag-version"    = "1"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "6e87dd2a370330444c98e387f7e0be34e74abf45e224b8a2f348802ed60a7165" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.yhegde-test-btk.module.iac_s3_bucket.aws_s3_bucket.this[0] will be created
+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "yhegde-test-btk"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "claimed_ownership"   = "true"
          + "managed-by"          = "iacasS"
          + "tcss:classification" = "green"
          + "tcss:tag-version"    = "1"
        }
      + tags_all                    = {
          + "claimed_ownership"   = "true"
          + "managed-by"          = "iacasS"
          + "platform:team"       = "plateng-iac"
          + "region"              = "us-east-1"
          + "tcss:classification" = "green"
          + "tcss:owner"          = "plateng-iac"
          + "tcss:tag-version"    = "1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
- yhegde-test-bkt_bucket_arn = "arn:aws:s3:::yhegde-test-bkt" -> null
+ yhegde-test-btk_bucket_arn = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p plateng-iac-597915711542-us-east-1
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://RTJ6HHJY52:4141/lock?id=yogeehhegde%252Ftest-atlantis-1746531411-1%252Fteams%252Fplateng-iac%252F597915711542%252Fus-east-1%252Fplateng-iac-597915711542-us-east-1)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p plateng-iac-597915711542-us-east-1
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```